---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.SpaceSet.Contains(Autodesk.Revit.DB.Mechanical.Space)
source: html/d9f57264-3bfd-bfbc-8ab7-0976eaf7ca72.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceSet.Contains Method

## Syntax (C#)
```csharp
public virtual bool Contains(
	Space item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Mechanical.Space`)